test/load/#04_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬────────┬────────┬─────────┬──────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%      │ Avg       │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼──────────┼───────────┼────────────┼──────────┤
│ Latency │ 211 ms │ 231 ms │ 4535 ms │ 10808 ms │ 1241.4 ms │ 1953.63 ms │ 19696 ms │
└─────────┴────────┴────────┴─────────┴──────────┴───────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 1.473  │ 1.473  │ 2.237   │ 2.289   │ 2.200  │ 171,33  │ 1.473  │
├───────────┼────────┼────────┼─────────┼─────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 666 kB │ 666 kB │ 1.01 MB │ 1.03 MB │ 994 kB │ 77.4 kB │ 666 kB │
└───────────┴────────┴────────┴─────────┴─────────┴────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 43992 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 75           │
├────────────┼──────────────┤
│ 0.01       │ 80           │
├────────────┼──────────────┤
│ 0.1        │ 112          │
├────────────┼──────────────┤
│ 1          │ 180          │
├────────────┼──────────────┤
│ 2.5        │ 211          │
├────────────┼──────────────┤
│ 10         │ 216          │
├────────────┼──────────────┤
│ 25         │ 220          │
├────────────┼──────────────┤
│ 50         │ 231          │
├────────────┼──────────────┤
│ 75         │ 2007         │
├────────────┼──────────────┤
│ 90         │ 3804         │
├────────────┼──────────────┤
│ 97.5       │ 4535         │
├────────────┼──────────────┤
│ 99         │ 10808        │
├────────────┼──────────────┤
│ 99.9       │ 17266        │
├────────────┼──────────────┤
│ 99.99      │ 19433        │
├────────────┼──────────────┤
│ 99.999     │ 19696        │
└────────────┴──────────────┘

47k requests in 20.15s, 19.9 MB read
3k errors (0 timeouts)