test/load/#05_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬───────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max      │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼───────────┼──────────┤
│ Latency │ 211 ms │ 226 ms │ 2675 ms │ 3326 ms │ 498.05 ms │ 741.94 ms │ 12038 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴───────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬──────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼─────────┼────────┤
│ Req/Sec   │ 1.570  │ 1.570  │ 2.251   │ 2.345   │ 2.194,31 │ 166,26  │ 1.570  │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼─────────┼────────┤
│ Bytes/Sec │ 710 kB │ 710 kB │ 1.02 MB │ 1.06 MB │ 992 kB   │ 75.1 kB │ 710 kB │
└───────────┴────────┴────────┴─────────┴─────────┴──────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 43881 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 65           │
├────────────┼──────────────┤
│ 0.01       │ 71           │
├────────────┼──────────────┤
│ 0.1        │ 175          │
├────────────┼──────────────┤
│ 1          │ 210          │
├────────────┼──────────────┤
│ 2.5        │ 211          │
├────────────┼──────────────┤
│ 10         │ 215          │
├────────────┼──────────────┤
│ 25         │ 219          │
├────────────┼──────────────┤
│ 50         │ 226          │
├────────────┼──────────────┤
│ 75         │ 267          │
├────────────┼──────────────┤
│ 90         │ 1328         │
├────────────┼──────────────┤
│ 97.5       │ 2675         │
├────────────┼──────────────┤
│ 99         │ 3326         │
├────────────┼──────────────┤
│ 99.9       │ 10314        │
├────────────┼──────────────┤
│ 99.99      │ 11818        │
├────────────┼──────────────┤
│ 99.999     │ 12038        │
└────────────┴──────────────┘

45k requests in 20.13s, 19.8 MB read
644 errors (0 timeouts)