test/load/#05_04-04-2024.txt
npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

/
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 117 ms │ 192 ms │ 10237 ms │ 10634 ms │ 1323.04 ms │ 2326.41 ms │ 11983 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬─────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 1.249  │ 1.249  │ 2.747   │ 3.407   │ 2.757,9 │ 510,75 │ 1.249  │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 840 kB │ 840 kB │ 1.85 MB │ 2.29 MB │ 1.85 MB │ 343 kB │ 839 kB │
└───────────┴────────┴────────┴─────────┴─────────┴─────────┴────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 55148 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 12           │
├────────────┼──────────────┤
│ 0.01       │ 18           │
├────────────┼──────────────┤
│ 0.1        │ 38           │
├────────────┼──────────────┤
│ 1          │ 105          │
├────────────┼──────────────┤
│ 2.5        │ 117          │
├────────────┼──────────────┤
│ 10         │ 134          │
├────────────┼──────────────┤
│ 25         │ 152          │
├────────────┼──────────────┤
│ 50         │ 192          │
├────────────┼──────────────┤
│ 75         │ 1252         │
├────────────┼──────────────┤
│ 90         │ 4344         │
├────────────┼──────────────┤
│ 97.5       │ 10237        │
├────────────┼──────────────┤
│ 99         │ 10634        │
├────────────┼──────────────┤
│ 99.9       │ 11330        │
├────────────┼──────────────┤
│ 99.99      │ 11789        │
├────────────┼──────────────┤
│ 99.999     │ 11983        │
└────────────┴──────────────┘

60k requests in 20.08s, 37.1 MB read
4k errors (0 timeouts)