test/load/#06_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 29 ms │ 45 ms │ 235 ms │ 327 ms │ 61.34 ms │ 52.42 ms │ 603 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 2.275   │ 2.275   │ 3.279  │ 4.027   │ 3.304,4 │ 459,91 │ 2.274   │
├───────────┼─────────┼─────────┼────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 1.53 MB │ 1.53 MB │ 2.2 MB │ 2.71 MB │ 2.22 MB │ 309 kB │ 1.53 MB │
└───────────┴─────────┴─────────┴────────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 66076 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 22           │
├────────────┼──────────────┤
│ 0.01       │ 22           │
├────────────┼──────────────┤
│ 0.1        │ 24           │
├────────────┼──────────────┤
│ 1          │ 27           │
├────────────┼──────────────┤
│ 2.5        │ 29           │
├────────────┼──────────────┤
│ 10         │ 35           │
├────────────┼──────────────┤
│ 25         │ 40           │
├────────────┼──────────────┤
│ 50         │ 45           │
├────────────┼──────────────┤
│ 75         │ 55           │
├────────────┼──────────────┤
│ 90         │ 100          │
├────────────┼──────────────┤
│ 97.5       │ 235          │
├────────────┼──────────────┤
│ 99         │ 327          │
├────────────┼──────────────┤
│ 99.9       │ 442          │
├────────────┼──────────────┤
│ 99.99      │ 566          │
├────────────┼──────────────┤
│ 99.999     │ 603          │
└────────────┴──────────────┘

68k requests in 20.06s, 44.4 MB read
1k errors (611 timeouts)