test/load/#06_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

-
┌─────────┬────────┬────────┬─────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 213 ms │ 226 ms │ 6680 ms │ 11581 ms │ 1341.97 ms │ 2435.75 ms │ 19696 ms │
└─────────┴────────┴────────┴─────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬─────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼─────────┼────────┤
│ Req/Sec   │ 1.259  │ 1.259  │ 2.231   │ 2.315   │ 2.194,2 │ 219,92  │ 1.259  │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼─────────┼────────┤
│ Bytes/Sec │ 569 kB │ 569 kB │ 1.01 MB │ 1.05 MB │ 992 kB  │ 99.3 kB │ 569 kB │
└───────────┴────────┴────────┴─────────┴─────────┴─────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 43876 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 53           │
├────────────┼──────────────┤
│ 0.01       │ 73           │
├────────────┼──────────────┤
│ 0.1        │ 142          │
├────────────┼──────────────┤
│ 1          │ 191          │
├────────────┼──────────────┤
│ 2.5        │ 213          │
├────────────┼──────────────┤
│ 10         │ 216          │
├────────────┼──────────────┤
│ 25         │ 219          │
├────────────┼──────────────┤
│ 50         │ 226          │
├────────────┼──────────────┤
│ 75         │ 1312         │
├────────────┼──────────────┤
│ 90         │ 4736         │
├────────────┼──────────────┤
│ 97.5       │ 6680         │
├────────────┼──────────────┤
│ 99         │ 11581        │
├────────────┼──────────────┤
│ 99.9       │ 18664        │
├────────────┼──────────────┤
│ 99.99      │ 19534        │
├────────────┼──────────────┤
│ 99.999     │ 19696        │
└────────────┴──────────────┘

48k requests in 20.12s, 19.8 MB read
3k errors (0 timeouts)