test/load/#07_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 32 ms │ 52 ms │ 336 ms │ 453 ms │ 73.44 ms │ 77.31 ms │ 936 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 2.119   │ 2.119   │ 3.049   │ 3.623   │ 2.985,2 │ 435,45 │ 2.119   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 1.42 MB │ 1.42 MB │ 2.05 MB │ 2.44 MB │ 2.01 MB │ 293 kB │ 1.42 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 59694 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 22           │
├────────────┼──────────────┤
│ 0.01       │ 25           │
├────────────┼──────────────┤
│ 0.1        │ 27           │
├────────────┼──────────────┤
│ 1          │ 30           │
├────────────┼──────────────┤
│ 2.5        │ 32           │
├────────────┼──────────────┤
│ 10         │ 38           │
├────────────┼──────────────┤
│ 25         │ 44           │
├────────────┼──────────────┤
│ 50         │ 52           │
├────────────┼──────────────┤
│ 75         │ 66           │
├────────────┼──────────────┤
│ 90         │ 105          │
├────────────┼──────────────┤
│ 97.5       │ 336          │
├────────────┼──────────────┤
│ 99         │ 453          │
├────────────┼──────────────┤
│ 99.9       │ 714          │
├────────────┼──────────────┤
│ 99.99      │ 910          │
├────────────┼──────────────┤
│ 99.999     │ 936          │
└────────────┴──────────────┘

61k requests in 20.08s, 40.1 MB read
1k errors (585 timeouts)